<a href="https://colab.research.google.com/github/tomasrodriguezr11/Programacion-MIAAD/blob/main/Practica17_266228.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Práctica 17 - Unidad 2: Limpieza y Transformación de Datos Categóricos**
**Programación para analítica descriptiva y predictiva MIAAD**

*Realizada por: Tomás Eduardo Rodríguez Ramírez*

*Número de matrícula: 266228*

# Instrucciones:
1. Descarga el archivo CSV, nls97, proporcionado en esta tarea. También lo puedes encontrar en recursos.
2. Crea un notebook en colab y guarda el archivo csv descargado en tu drive.
3. Agrega secciones en el colab poniendo como título el nombre de cada ejercicio

**Ejercicio 01: Errores Tipográficos y Valores Inconsistentes: maritalstatus**
- Imprime de la columna 'maritalstatus' los valores únicos.
- Imprime la frecuencia de cada valor único
- Cambia el valor 'Never-Married' a 'Single'
- Imprime la frecuencia de cada valor único.

**Ejercicio 02: Errores Tipográficos y Valores Inconsistentes: highestdegree**
- Imprime de la columna 'highestdegrees' los valores únicos.
- Imprime la frecuencia de cada valor único
- Observa que cada valor categórico empieza con 0. Modifica las categorías para que todas estén en minúsculas y ninguna empiece con un número. Por ejemplo, si dice "2. High School", debería ser 'high school.
- Los cambios se realizarán en la misma columna 'highestdegrees'.
- Imprime los nuevos valores únicos.

**Ejercicio 03: Alta Cardinalidad - Frecuencias Bajas**
- De la columna 'maritalstatus' une las categorías Widowed y 'Single' en una categoría más general llamada 'Single/No Partner'. Crea una nueva columna, 'marital_grouped' donde aparezcan las nuevas categorías de maritalstatus.
- Imprime los valores únicos de la nueva columna 'marital_grouped'.
- Imprime la frecuencia de los valores únicos de la nueva columna 'marital_grouped'

**Ejercicio 04: Tipos de Datos**
- Imprime el tipo de datos de la columna gender
- Imprime la cantidad de bytes de dicha columna
- Si la columna es de tipo object, modifica a category.
- En caso de haber realizado la modificación del tipo de datos, imprime la cantidad de bytes que ocupa dicha columna con el nuevo tipo de datos


Sube un archivo txt que contenga la liga a tu notebook

In [1]:
# Carga de liberías y dataset
import pandas as pd

dataset="drive/MyDrive/ProgramacionMIAAD/nls97.csv"
df = pd.read_csv(dataset)
df

,personid,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,...,colenrfeb13,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17
0,100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
1,100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
2,100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
3,100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN
4,100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8979,999291,Female,4,1981,16.0,Married,NaN,NaN,35000.0,7 to 9 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8980,999406,Male,7,1982,14.0,Never-married,NaN,NaN,116000.0,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8981,999543,Female,8,1984,12.0,Divorced,2.0,0.0,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8982,999698,Female,5,1983,12.0,Never-married,5.0,0.0,NaN,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8983,999963,Female,9,1982,17.0,Married,2.0,0.0,50000.0,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled

# **Ejercicio 01: Errores Tipográficos y Valores Inconsistentes: maritalstatus**

In [2]:
# Valores únicos de la columna maritalstatus
display(df['maritalstatus'].unique())

array(['Married', 'Never-married', nan, 'Divorced', 'Separated',
       'Widowed'], dtype=object)

In [3]:
# Frecuencia de cada valor único de la columna maritalstatus
display(df['maritalstatus'].value_counts())

maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

In [4]:
# Cambio del valor 'Never-Married' a 'Single'
df['maritalstatus'] = df['maritalstatus'].replace('Never-married', 'Single')

# Frecuencia de cada valor úncio después del cambio
display(df['maritalstatus'].value_counts())

maritalstatus
Married      3066
Single       2766
Divorced      663
Separated     154
Widowed        23
Name: count, dtype: int64

# **Ejercicio 02: Errores Tipográficos y Valores Inconsistentes: highestdegree**

In [5]:
# Valores únicos de la columna highestdegree
display(df['highestdegree'].unique())

array(['2. High School', '0. None', '4. Bachelors', '3. Associates',
       '5. Masters', '1. GED', '7. Professional', '6. PhD', nan],
      dtype=object)

In [6]:
# Frecuencia de cada valor único de la columna highestdegree
display(df['highestdegree'].value_counts())

highestdegree
2. High School     3667
4. Bachelors       1673
1. GED             1146
0. None             953
3. Associates       737
5. Masters          603
7. Professional     120
6. PhD               54
Name: count, dtype: int64

In [7]:
# Modificación de categorías: Convertir a minúsculas y quitar número
df['highestdegree'] = (
    df['highestdegree']
    .str.replace(r'^\d+\.\s*', '', regex=True)
    .str.lower()
)

# Frecuencia de cada valor úncio después del cambio
display(df['highestdegree'].unique())

array(['high school', 'none', 'bachelors', 'associates', 'masters', 'ged',
       'professional', 'phd', nan], dtype=object)

#**Ejercicio 03: Alta Cardinalidad - Frecuencias Bajas**

In [8]:
# Unión de las categorías Widowed y Single de la columna maritalstatus en una categoría más general llamada Single/No Partner
# Creación de nueva columna marital_grouped para las nuevas categorías de maritalstatu

df['marital_grouped'] = df['maritalstatus'].replace({
    'Widowed': 'Single/No Partner',
    'Single': 'Single/No Partner'
})

# Valores únicos de la nueva columna marital_gruped
display(df['marital_grouped'].unique())

array(['Married', 'Single/No Partner', nan, 'Divorced', 'Separated'],
      dtype=object)

In [9]:
# Frecuencia de cada valor único de la nueva columna marital_gruped
display(df['marital_grouped'].value_counts())

marital_grouped
Married              3066
Single/No Partner    2789
Divorced              663
Separated             154
Name: count, dtype: int64

#**Ejercicio 04: Tipos de Datos**

In [10]:
# Tipo de datos de la columna gender
print(df['gender'].dtype)

object

In [11]:
# Cantidad de bytes de columna gender
print(df['gender'].memory_usage(deep=True))

485054

In [13]:
# Columna tipo object se modifica a tipo category
if df['gender'].dtype == 'object':
    df['gender'] = df['gender'].astype('category')

# Cantidad de bytes que ocupa la columna gender con el nuevo tipo de datos
print(df['gender'].memory_usage(deep=True))

9332